# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Migrate or backup IMAP mail accounts
brew "imapsync"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Draw UML diagrams
brew "plantuml"
# Theme for zsh
brew "powerlevel10k"
# Cross-shell prompt for astronauts
brew "starship"
# Manipulate and query tags on macOS files
brew "tag"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for 1Password
cask "1password-cli"
# Photography workflow application and raw developer
cask "darktable"
cask "font-agave-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-iosevka"
cask "font-monofur-nerd-font"
go "cmd/go"
go "cmd/gofmt"
uv "specify-cli"
